![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Using%20Views/images/IDSNlogo.png)

# Hands-on Lab: Using Views

**Estimated time needed**: 10 minutes

In this lab, you will learn about using views. In SQL, a view is an alternative way of representing data that exists in one or more tables. Just like a real table, it contains rows and columns. The fields in a view are fields from one or more real tables in the database. Though views can be queried like a table, views are dynamic; only the definition of the view is stored, not the data.

**How does the syntax of a CREATE VIEW statement look?**

```sql
CREATE VIEW view_name AS
SELECT column1, column2, ...
FROM table_name
WHERE condition;
```

**How does the syntax of a REPLACE VIEW statement look?**

```sql
CREATE OR REPLACE VIEW view_name AS
SELECT column1, column2, ...
FROM table_name
WHERE condition;
```

**How does the syntax of a DROP VIEW statement look?**

```sql
DROP VIEW view_name;
```

# Software Used in this Lab

In this lab, you will use [IBM Db2 Database](https://www.ibm.com/products/db2-database?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2022-01-01). Db2 is a Relational Database Management System (RDBMS) from IBM, designed to store, analyze and retrieve the data efficiently.

To complete this lab you will utilize a Db2 database service on IBM Cloud. If you did not already complete this lab task earlier in this module, you will not yet have access to Db2 on IBM Cloud, and you will need to follow the lab below first:

- [Hands-on Lab : Sign up for IBM Cloud, Create Db2 service instance and Get started with the Db2 console](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sign%20up%20for%20IBM%20Cloud%20-%20Create%20Db2%20service%20instance%20-%20Get%20started%20with%20the%20Db2%20console/instructional-labs.md.html)

# Database Used in this Lab

The database used in this lab is an internal database. You will be working on a sample HR database. This HR database schema consists of 5 tables called **EMPLOYEES, JOB_HISTORY, JOBS, DEPARTMENTS** and **LOCATIONS**. Each table has a few rows of sample data. The following diagram shows the tables for the HR database:

![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Using%20Views/images/HR_Database.PNG)

**NOTE**: This lab requires you to have all 5 of these tables of the HR database populated with sample data on Db2. If you don't have the tables above populated with sample data on Db2, please go through the lab below first:

- [Hands-on Lab : Create tables using SQL scripts and Load data into tables](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Create%20tables%20using%20SQL%20scripts%20and%20Load%20data%20into%20tables/instructional-labs.md.html)

# Objectives

After completing this lab, you will be able to:

- Create a View and show a selection of data for a given table
- Update a View to combine two or more tables in meaningful ways
- Drop a created View

# Instructions

When you approach the exercises in this lab, follow the instructions to run the queries on Db2:

Go to the [Resource List](https://cloud.ibm.com/resources?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2022-01-01) of IBM Cloud by logging in where you can find the Db2 service instance that you created in a previous lab under **Services** section. Click on the **Db2-xx service**. Next, open the Db2 Console by clicking on **Open Console** button. Click on the 3-bar menu icon in the top left corner and go to the **Run SQL** page. The Run SQL tool enables you to run SQL statements.

If needed, follow [Hands-on Lab : Sign up for IBM Cloud, Create Db2 service instance and Get started with the Db2 console](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sign%20up%20for%20IBM%20Cloud%20-%20Create%20Db2%20service%20instance%20-%20Get%20started%20with%20the%20Db2%20console/instructional-labs.md.html)

In [23]:
import sqlite3
import pandas as pd

%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [24]:
con = sqlite3.connect('data/database.db')
cur = con.cursor()

In [25]:
%sql sqlite:///data/database.db

# Exercise 1: Create a View

In this exercise, you will create a View and show a selection of data for a given table.

1. Let's create a view called **EMPSALARY** to display salary along with some basic sensitive data of employees from the HR database. To create the **EMPSALARY** view from the **EMPLOYEES** table, copy the code below and paste it to the textbox of the **Run SQL** page. Click **Run all**.

```sql
CREATE VIEW EMPSALARY AS 
SELECT EMP_ID, F_NAME, L_NAME, B_DATE, SEX, SALARY
FROM EMPLOYEES; 
```

![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Using%20Views/images/1.1.png)

In [26]:
%%sql

CREATE VIEW EMPSALARY AS 
SELECT EMP_ID, F_NAME, L_NAME, B_DATE, SEX, SALARY
FROM EMPLOYEES;

 * sqlite:///data/database.db
Done.

[]

2. Using SELECT, query the **EMPSALARY** view to retrieve all the records. Copy the code below and paste it to the textbox of the **Run SQL** page. Click **Run all**.

```sql
SELECT * FROM EMPSALARY;
```

![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Using%20Views/images/1.2.png)

In [27]:
query = '''
            SELECT *
            FROM EMPSALARY; 
        '''
df = pd.read_sql_query(query, con)
df

  EMP_ID   F_NAME   L_NAME      B_DATE SEX  SALARY
0  E1001     John   Thomas  01/09/1976   M  100000
1  E1002    Alice    James  07/31/1972   F   80000
2  E1003    Steve    Wells  08/10/1980   M   50000
3  E1004  Santosh    Kumar  07/20/1985   M   60000
4  E1005    Ahmed  Hussain  01/04/1981   M   70000
5  E1006    Nancy    Allen  02/06/1978   F   90000
6  E1007     Mary   Thomas  05/05/1975   F   65000
7  E1008  Bharath    Gupta  05/06/1985   M   65000
8  E1009   Andrea    Jones  07/09/1990   F   70000
9  E1010      Ann    Jacob  03/30/1982   F   70000

# Exercise 2: Update a View

In this exercise, you will update a View to combine two or more tables in meaningful ways.

1. It now seems that the **EMPSALARY** view we created in exercise 1 doesn't contain enough salary information, such as max/min salary and the job title of the employees. Let's update the **EMPSALARY** view:

    - combining two tables **EMPLOYEES** and **JOBS** so that we can display our desired information from the HR database.
    - including the columns **JOB_TITLE, MIN_SALARY, MAX_SALARY** of the **JOBS** table as well as excluding the **SALARY** column of the **EMPLOYEES** table.

Copy the code below and paste it to the textbox of the **Run SQL** page. Click **Run all**.

```sql
CREATE OR REPLACE VIEW EMPSALARY  AS 
SELECT EMP_ID, F_NAME, L_NAME, B_DATE, SEX, JOB_TITLE, MIN_SALARY, MAX_SALARY
FROM EMPLOYEES, JOBS
WHERE EMPLOYEES.JOB_ID = JOBS.JOB_IDENT;
```

**NOTE**: Don't worry if you don't understand how to combine to two tables using implicit inner join. You will learn more about joins later on. For now, just think you are combining the data of two different tables, **EMPLOYEES** and **JOBS** by connecting their respective columns **JOB_ID** and **JOB_IDENT** since both the columns contain common unique data. You can have a look at the diagram (at the beginning of the lab) showing the tables for the HR database to observe how the **JOB_ID** and **JOB_IDENT** columns from the **EMPLOYEES** and **JOBS** tables respectively contain common unique data.

![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Using%20Views/images/2.1.png)

In [28]:
%%sql

DROP VIEW IF EXISTS EMPSALARY;

CREATE VIEW EMPSALARY AS 
SELECT EMP_ID, F_NAME, L_NAME, B_DATE, SEX, JOB_TITLE, MIN_SALARY, MAX_SALARY
FROM EMPLOYEES, JOBS
WHERE EMPLOYEES.JOB_ID == JOBS.JOB_IDENT;

 * sqlite:///data/database.db
Done.
Done.

[]

2. Using SELECT, query the updated **EMPSALARY** view to retrieve all the records. Copy the code below and paste it to the textbox of the **Run SQL** page. Click **Run all**.

```sql
SELECT * FROM EMPSALARY;
```

![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Using%20Views/images/2.2.png)

In [29]:
query = '''
            SELECT *
            FROM EMPSALARY; 
        '''
df = pd.read_sql_query(query, con)
df

,EMP_ID,F_NAME,L_NAME,B_DATE,SEX,JOB_TITLE,MIN_SALARY,MAX_SALARY
0,E1001,John,Thomas,01/09/1976,M,Sr. Architect,60000,100000
1,E1002,Alice,James,07/31/1972,F,Sr.Software Developer,60000,80000
2,E1003,Steve,Wells,08/10/1980,M,Jr.Software Developer,40000,60000
3,E1004,Santosh,Kumar,07/20/1985,M,Jr.Software Developer,40000,60000
4,E1005,Ahmed,Hussain,01/04/1981,M,Jr. Architect,50000,70000
5,E1006,Nancy,Allen,02/06/1978,F,Lead Architect,70000,100000
6,E1007,Mary,Thomas,05/05/1975,F,Jr. Designer,60000,70000
7,E1008,Bharath,Gupta,05/06/1985,M,Jr. Designer,60000,70000
8,E1009,Andrea,Jones,07/09/1990,F,Sr. Designer,70000,90000
9,E1010,Ann,Jacob,03/30/1982,F,Sr. Designer,70000,90000

# Exercise 3: Drop a View

In this exercise, you will drop a created View.

1. Let's delete the created **EMPSALARY** view. Copy the code below and paste it to the textbox of the **Run SQL** page. Click **Run all**.

```sql
DROP VIEW EMPSALARY;
```

![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Using%20Views/images/3.1.png)

In [30]:
%%sql

DROP VIEW EMPSALARY;

 * sqlite:///data/database.db
Done.

[]

2. Using SELECT, you can verify whether the **EMPSALARY** view has been deleted or not. Copy the code below and paste it to the textbox of the **Run SQL** page. Click **Run all**.

```sql
SELECT * FROM EMPSALARY;
```

![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Using%20Views/images/3.2.png)

In [31]:
query = '''
            SELECT *
            FROM EMPSALARY; 
        '''
try:
    df = pd.read_sql_query(query, con)
    df
except Exception as e: 
    print(e)

Execution failed on sql '
            SELECT *
            FROM EMPSALARY;
        ': no such table: EMPSALARY

## Congratulations! You have completed this lab, and you are ready for the next topic.

In [32]:
con.close()

# Author(s)

- [Sandip Saha Joy](https://www.linkedin.com/in/sandipsahajoy/?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2022-01-01)

# Other Contributor(s)

-

## Changelog

| Date              | Version | Changed By          | Change Description      |
| ----------------- | ------- | ------------------- | ----------------------- |
| 2020-12-24        | 1.1     | Steve Ryan          | ID Review               |
| 2020-12-14        | 1.0     | Sandip Saha Joy     | Created initial version |

## <h3 align="center"> © IBM Corporation 2020. All rights reserved. <h3/>